In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

obj=Series([3,6,9,12.2])

In [7]:
obj

0     3.0
1     6.0
2     9.0
3    12.2
dtype: float64

In [9]:
obj.values

array([  3. ,   6. ,   9. ,  12.2])

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
ww2=Series([870000,430000,300000,450000,40000],index=['USSR','Germany','China','Japan','USA'])
ww2

USSR       870000
Germany    430000
China      300000
Japan      450000
USA         40000
dtype: int64

In [18]:
ww2["Japan"]

450000

In [21]:
ww2['Germany':'Japan']

Germany    430000
China      300000
Japan      450000
dtype: int64

In [23]:
ww2[ww2>=430000]

USSR       870000
Germany    430000
Japan      450000
dtype: int64

In [24]:
'USSR' in ww2

True

In [25]:
# Series behaves like a dictionary
# So we convert it to a dictionary
ww2_dict=ww2.to_dict()

In [26]:
ww2_dict

{'China': 300000,
 'Germany': 430000,
 'Japan': 450000,
 'USA': 40000,
 'USSR': 870000}

In [27]:
ww2_series=Series(ww2_dict)
ww2_series
# Cool

China      300000
Germany    430000
Japan      450000
USA         40000
USSR       870000
dtype: int64

In [28]:
countries = ['China','Germany','Japan','USA','USSR','Argentina']

In [29]:
obj2=Series(ww2_dict,index=countries)
obj2

China        300000.0
Germany      430000.0
Japan        450000.0
USA           40000.0
USSR         870000.0
Argentina         NaN
dtype: float64

In [30]:
pd.isnull(obj2)

China        False
Germany      False
Japan        False
USA          False
USSR         False
Argentina     True
dtype: bool

In [31]:
pd.notnull(obj2)

China         True
Germany       True
Japan         True
USA           True
USSR          True
Argentina    False
dtype: bool

In [32]:
ww2

USSR       870000
Germany    430000
China      300000
Japan      450000
USA         40000
dtype: int64

In [33]:
ww2_series

China      300000
Germany    430000
Japan      450000
USA         40000
USSR       870000
dtype: int64

In [34]:
obj2

China        300000.0
Germany      430000.0
Japan        450000.0
USA           40000.0
USSR         870000.0
Argentina         NaN
dtype: float64

In [36]:
ww2_series+obj2

Argentina          NaN
China         600000.0
Germany       860000.0
Japan         900000.0
USA            80000.0
USSR         1740000.0
dtype: float64

In [37]:
obj2.name="World War 2 Casualties"

In [38]:
obj2

China        300000.0
Germany      430000.0
Japan        450000.0
USA           40000.0
USSR         870000.0
Argentina         NaN
Name: World War 2 Casualties, dtype: float64

In [39]:
obj2.index

Index(['China', 'Germany', 'Japan', 'USA', 'USSR', 'Argentina'], dtype='object')

In [40]:
obj2.index.name="Countries"
obj2

Countries
China        300000.0
Germany      430000.0
Japan        450000.0
USA           40000.0
USSR         870000.0
Argentina         NaN
Name: World War 2 Casualties, dtype: float64

In [41]:
obj2.values

array([ 300000.,  430000.,  450000.,   40000.,  870000.,      nan])

In [43]:
import webbrowser
website = 'http://en.wikipedia.org/wiki/NFL_win-loss_records'
webbrowser.open(website)

True

In [44]:
nfl=pd.read_clipboard()
# Fuuuuuuuuck

In [45]:
nfl

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East
6,7,Denver Broncos,465,393,10,0.541,1960,868,AFC West
7,8,Minnesota Vikings,457,387,10,0.541,1961,854,NFC North
8,9,Baltimore Ravens,181,154,1,0.540,1996,336,AFC North
9,10,San Francisco 49ers,522,450,14,0.537,1950,986,NFC West

In [46]:
nfl["Team"]

0          Dallas Cowboys
1       Green Bay Packers
2           Chicago Bears
3          Miami Dolphins
4    New England Patriots
5         New York Giants
6          Denver Broncos
7       Minnesota Vikings
8        Baltimore Ravens
9     San Francisco 49ers
Name: Team, dtype: object

In [48]:
nfl.columns

Index(['Rank', 'Team', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Total Games', 'Division'],
      dtype='object')

In [53]:
nfl["First NFL Season"]

0    1960
1    1921
2    1920
3    1966
4    1960
5    1925
6    1960
7    1961
8    1996
9    1950
Name: First NFL Season, dtype: int64

In [56]:
DataFrame(nfl,columns=["Team","First NFL Season","Total Games"])

                   Team  First NFL Season Total Games
0        Dallas Cowboys              1960         866
1     Green Bay Packers              1921       1,320
2         Chicago Bears              1920       1,354
3        Miami Dolphins              1966         784
4  New England Patriots              1960         868
5       New York Giants              1925       1,289
6        Denver Broncos              1960         868
7     Minnesota Vikings              1961         854
8      Baltimore Ravens              1996         336
9   San Francisco 49ers              1950         986

In [57]:
DataFrame(nfl,columns=["Team","First NFL Season","Total"])
# Null for non existent values

                   Team  First NFL Season  Total
0        Dallas Cowboys              1960    NaN
1     Green Bay Packers              1921    NaN
2         Chicago Bears              1920    NaN
3        Miami Dolphins              1966    NaN
4  New England Patriots              1960    NaN
5       New York Giants              1925    NaN
6        Denver Broncos              1960    NaN
7     Minnesota Vikings              1961    NaN
8      Baltimore Ravens              1996    NaN
9   San Francisco 49ers              1950    NaN

In [58]:
nfl.head(3)

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North

In [60]:
nfl.tail(3)

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
7,8,Minnesota Vikings,457,387,10,0.541,1961,854,NFC North
8,9,Baltimore Ravens,181,154,1,0.540,1996,336,AFC North
9,10,San Francisco 49ers,522,450,14,0.537,1950,986,NFC West

In [62]:
nfl.tail()
# Default value of head and tail is 5

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East
6,7,Denver Broncos,465,393,10,0.541,1960,868,AFC West
7,8,Minnesota Vikings,457,387,10,0.541,1961,854,NFC North
8,9,Baltimore Ravens,181,154,1,0.540,1996,336,AFC North
9,10,San Francisco 49ers,522,450,14,0.537,1950,986,NFC West

In [66]:
nfl

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East
6,7,Denver Broncos,465,393,10,0.541,1960,868,AFC West
7,8,Minnesota Vikings,457,387,10,0.541,1961,854,NFC North
8,9,Baltimore Ravens,181,154,1,0.540,1996,336,AFC North
9,10,San Francisco 49ers,522,450,14,0.537,1950,986,NFC West

In [71]:
nfl.ix[2]

Rank                            3
Team                Chicago Bears
Won                           744
Lost                          568
Tied                           42
Pct.                        0.565
First NFL Season             1920
Total Games                 1,354
Division                NFC North
Name: 2, dtype: object

In [72]:
nfl["Stadium"]="Levis Stadium"
# Puts for all the rows

In [73]:
nfl

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East,Levis Stadium
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North,Levis Stadium
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North,Levis Stadium
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East,Levis Stadium
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East,Levis Stadium
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East,Levis Stadium
6,7,Denver Broncos,465,393,10,0.541,1960,868,AFC West,Levis Stadium
7,8,Minnesota Vikings,457,387,10,0.541,1961,854,NFC North,Levis Stadium
8,9,Baltimore Ravens,181,154,1,0.540,1996,336,AFC North,Levis Stadium
9,10,San Francisco 49ers,522,450,14,0.537,1950,986,NFC West,Levis Stadium

In [78]:
nfl['Stadium']=np.arange(10)

In [79]:
nfl

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East,0
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North,1
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North,2
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East,3
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East,4
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East,5
6,7,Denver Broncos,465,393,10,0.541,1960,868,AFC West,6
7,8,Minnesota Vikings,457,387,10,0.541,1961,854,NFC North,7
8,9,Baltimore Ravens,181,154,1,0.540,1996,336,AFC North,8
9,10,San Francisco 49ers,522,450,14,0.537,1950,986,NFC West,9

In [80]:
stadiums = Series(["Levi's Stadium","AT&T Stadium"],index=[5,0])

In [81]:
stadiums

5    Levi's Stadium
0      AT&T Stadium
dtype: object

In [82]:
nfl["Stadium"]=stadiums

In [83]:
nfl

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division,Stadium
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East,AT&T Stadium
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North,NaN
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North,NaN
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East,NaN
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East,NaN
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East,Levi's Stadium
6,7,Denver Broncos,465,393,10,0.541,1960,868,AFC West,NaN
7,8,Minnesota Vikings,457,387,10,0.541,1961,854,NFC North,NaN
8,9,Baltimore Ravens,181,154,1,0.540,1996,336,AFC North,NaN
9,10,San Francisco 49ers,522,450,14,0.537,1950,986,NFC West,NaN

In [84]:
del nfl["Stadium"]
nfl

,Rank,Team,Won,Lost,Tied,Pct.,First NFL Season,Total Games,Division
0,1,Dallas Cowboys,493,367,6,0.573,1960,866,NFC East
1,2,Green Bay Packers,730,553,37,0.567,1921,"1,320",NFC North
2,3,Chicago Bears,744,568,42,0.565,1920,"1,354",NFC North
3,4,Miami Dolphins,439,341,4,0.563,1966,784,AFC East
4,5,New England Patriots,476,383,9,0.554,1960,868,AFC East
5,6,New York Giants,684,572,33,0.543,1925,"1,289",NFC East
6,7,Denver Broncos,465,393,10,0.541,1960,868,AFC West
7,8,Minnesota Vikings,457,387,10,0.541,1961,854,NFC North
8,9,Baltimore Ravens,181,154,1,0.540,1996,336,AFC North
9,10,San Francisco 49ers,522,450,14,0.537,1950,986,NFC West

In [85]:
data = {'City':['SF','LA','NYC'],
        'Population':[837000,3880000,8400000]}

In [86]:
data

{'City': ['SF', 'LA', 'NYC'], 'Population': [837000, 3880000, 8400000]}

In [87]:
city_frame=DataFrame(data)
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000

In [88]:
website = 'http://pandas.pydata.org/pandas-docs/dev/generated/pandas.DataFrame.html'
webbrowser.open(website)

True

In [93]:
z=DataFrame.boxplot(city_frame)

In [92]:
import matplotlib.pyplot as plt

In [105]:
ser=Series([1,2,3,4],index=['A','B','C','D'])
ser

A    1
B    2
C    3
D    4
dtype: int64

In [106]:
ind=ser.index
ind

Index(['A', 'B', 'C', 'D'], dtype='object')

In [109]:
ind[0]='Z'
# Indexes are immutable

TypeError: Index does not support mutable operations

In [31]:
from numpy.random import randn

In [5]:
ser1=Series([1,2,3,4],index=['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [6]:
ser2=ser1.reindex(['A','B','C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [10]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [11]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [13]:
ser3.reindex(range(15))

0        USA
1        NaN
2        NaN
3        NaN
4        NaN
5     Mexico
6        NaN
7        NaN
8        NaN
9        NaN
10    Canada
11       NaN
12       NaN
13       NaN
14       NaN
dtype: object

In [14]:
ser3.reindex(range(14),method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
dtype: object

In [15]:
ser3.reindex(range(14),method='bfill')

0        USA
1     Mexico
2     Mexico
3     Mexico
4     Mexico
5     Mexico
6     Canada
7     Canada
8     Canada
9     Canada
10    Canada
11       NaN
12       NaN
13       NaN
dtype: object

In [19]:
ser3=ser3.reindex(range(14),method='nearest')

In [20]:
ser3

0        USA
1        USA
2        USA
3     Mexico
4     Mexico
5     Mexico
6     Mexico
7     Mexico
8     Canada
9     Canada
10    Canada
11    Canada
12    Canada
13    Canada
dtype: object

In [21]:
df1=DataFrame(ser3)
df1

         0
0      USA
1      USA
2      USA
3   Mexico
4   Mexico
5   Mexico
6   Mexico
7   Mexico
8   Canada
9   Canada
10  Canada
11  Canada
12  Canada
13  Canada

In [34]:
df1.columns=['Countries']

In [39]:
df1

   Countries
0        USA
1        USA
2        USA
3     Mexico
4     Mexico
5     Mexico
6     Mexico
7     Mexico
8     Canada
9     Canada
10    Canada
11    Canada
12    Canada
13    Canada

In [5]:
df=DataFrame(randn(25).reshape(5,5),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])
df

       col1      col2      col3      col4      col5
A -0.679836  0.200362 -1.668622 -0.449286 -0.054385
B  1.219410  0.947198 -0.807052  0.333022  2.203965
D -0.401659 -0.049467  2.284887  0.257815 -0.653426
E -0.585200 -0.076289 -0.601476 -0.160995  1.146479
F  0.392527 -0.591401  0.562919 -0.656403  0.141515

In [50]:
df[df>=0]

       col1      col2      col3      col4      col5
A       NaN  0.745450  0.918360  0.575491       NaN
B  1.675170  1.453681  1.595845       NaN       NaN
D       NaN       NaN       NaN  0.925833  0.738013
E  0.617749       NaN  0.299520       NaN  1.003201
F  0.501139       NaN  0.913492       NaN       NaN

In [51]:
df.ix["F"]

col1    0.501139
col2   -0.505442
col3    0.913492
col4   -1.234698
col5   -1.623128
Name: F, dtype: float64

In [9]:
df1 = df.reindex(['A','B','C','D','E','F'])
df1

       col1      col2      col3      col4      col5
A -0.679836  0.200362 -1.668622 -0.449286 -0.054385
B  1.219410  0.947198 -0.807052  0.333022  2.203965
C       NaN       NaN       NaN       NaN       NaN
D -0.401659 -0.049467  2.284887  0.257815 -0.653426
E -0.585200 -0.076289 -0.601476 -0.160995  1.146479
F  0.392527 -0.591401  0.562919 -0.656403  0.141515

In [68]:
df1

       col1      col2      col3      col4      col5
A -1.171078  0.745450  0.918360  0.575491 -1.547617
B  1.675170  1.453681  1.595845 -0.903387 -0.324866
C       NaN       NaN       NaN       NaN       NaN
D -0.647086 -0.037542 -1.991668  0.925833  0.738013
E  0.617749 -0.937675  0.299520 -1.185935  1.003201
F  0.501139 -0.505442  0.913492 -1.234698 -1.623128

In [7]:
newcl= ['col1','col2','col3','col4','col5','col6']

In [10]:
df1.reindex(columns=newcl)
df1

       col1      col2      col3      col4      col5
A -0.679836  0.200362 -1.668622 -0.449286 -0.054385
B  1.219410  0.947198 -0.807052  0.333022  2.203965
C       NaN       NaN       NaN       NaN       NaN
D -0.401659 -0.049467  2.284887  0.257815 -0.653426
E -0.585200 -0.076289 -0.601476 -0.160995  1.146479
F  0.392527 -0.591401  0.562919 -0.656403  0.141515

In [11]:
newcl

['col1', 'col2', 'col3', 'col4', 'col5', 'col6']

In [12]:
df.ix[['A','B','C','D','E','F'],newcl]

       col1      col2      col3      col4      col5  col6
A -0.679836  0.200362 -1.668622 -0.449286 -0.054385   NaN
B  1.219410  0.947198 -0.807052  0.333022  2.203965   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.401659 -0.049467  2.284887  0.257815 -0.653426   NaN
E -0.585200 -0.076289 -0.601476 -0.160995  1.146479   NaN
F  0.392527 -0.591401  0.562919 -0.656403  0.141515   NaN

In [13]:
df

       col1      col2      col3      col4      col5
A -0.679836  0.200362 -1.668622 -0.449286 -0.054385
B  1.219410  0.947198 -0.807052  0.333022  2.203965
D -0.401659 -0.049467  2.284887  0.257815 -0.653426
E -0.585200 -0.076289 -0.601476 -0.160995  1.146479
F  0.392527 -0.591401  0.562919 -0.656403  0.141515

In [4]:
ser1=Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [17]:
ser1.drop('c')

a    0
b    1
dtype: int32

In [36]:
df1=DataFrame(np.arange(9).reshape(3,3),index=['SF','LA','NYC'],columns=['pop','size','year'])
df1

     pop  size  year
SF     0     1     2
LA     3     4     5
NYC    6     7     8

In [22]:
df1=df1.drop('LA')
# Default axis is 0 that is row

In [23]:
df1

     pop  size  year
SF     0     1     2
NYC    6     7     8

In [24]:
df1.drop('year',axis=1)

     pop  size
SF     0     1
NYC    6     7

In [5]:
ser1

a    0
b    1
c    2
dtype: int32

In [26]:
ser2=ser1*2
ser2

a    0
b    2
c    4
dtype: int32

In [28]:
ser2['b']

2

In [29]:
ser2[1]

2

In [30]:
ser2[:2]

a    0
b    2
dtype: int32

In [44]:
DataFrame(df1,columns=['pop','year'])

     pop  year
SF     0     2
LA     3     5
NYC    6     8

In [46]:
ser2[['a','c']]

a    0
c    4
dtype: int32

In [48]:
ser2[ser2>=2]

b    2
c    4
dtype: int32

In [49]:
ser2[ser2>3]=10

In [50]:
ser2

a     0
b     2
c    10
dtype: int32

In [56]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','Chi'],columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [57]:
dframe.B

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [58]:
dframe[['A','C','E']]

      A   C   E
NYC   0   2   4
LA    5   7   9
SF   10  12  14
DC   15  17  19
Chi  20  22  24

In [60]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [63]:
dframe>8

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False   True
SF    True   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [69]:
dframe.ix['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [70]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [76]:
dframe.ix[0]

A    0
B    1
C    2
D    3
E    4
Name: NYC, dtype: int32

In [80]:
ser1.reindex(['A','B','C'])

A   NaN
B   NaN
C   NaN
dtype: float64

In [81]:
ser1

a    0
b    1
c    2
dtype: int32

In [82]:
ser1.index.name='Pure Index'
ser1

Pure Index
a    0
b    1
c    2
dtype: int32

In [83]:
type(ser1)

pandas.core.series.Series

In [6]:
ser1=Series([3,4,5,6],index=['a','b','c','d'])
ser1

a    3
b    4
c    5
d    6
dtype: int64

In [85]:
ser1

a    3
b    4
c    5
d    6
dtype: int64

In [7]:
ser2 = Series([0,1,2],index=['a','b','c'])
ser2

a    0
b    1
c    2
dtype: int64

In [8]:
ser1+ser2

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [12]:
df1=DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])
df1

     A  B
NYC  0  1
LA   2  3

In [15]:
df2=DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','SF','LA'])
df2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [16]:
df1+df2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [17]:
df1.add(df2,fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [22]:
ser3=df2.ix[0]
ser3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [23]:
type(ser3)

pandas.core.series.Series

In [24]:
type(df2)

pandas.core.frame.DataFrame

In [25]:
df2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

In [26]:
ser1 = Series(range(3),index=['C','A','B'])
ser1

C    0
A    1
B    2
dtype: int32

In [27]:
ser1.sort_index()

A    1
B    2
C    0
dtype: int32

In [28]:
ser1.sort_values()

C    0
A    1
B    2
dtype: int32

In [30]:
ser1.order()

c:\users\rijhwani\appdata\local\programs\python\python35-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: order is deprecated, use sort_values(...)
  """Entry point for launching an IPython kernel.

C    0
A    1
B    2
dtype: int32

In [32]:
ser2=Series(randn(10))
ser2

0    1.692564
1   -1.109468
2   -0.448833
3   -0.508117
4    1.008738
5   -0.360954
6    1.463313
7   -0.347693
8    1.793927
9   -2.836179
dtype: float64

In [34]:
ser2.sort_values()

9   -2.836179
1   -1.109468
3   -0.508117
2   -0.448833
5   -0.360954
7   -0.347693
4    1.008738
6    1.463313
0    1.692564
8    1.793927
dtype: float64

In [35]:
ser2.rank()

9     1.0
1     2.0
3     3.0
2     4.0
5     5.0
7     6.0
4     7.0
6     8.0
0     9.0
8    10.0
dtype: float64